TeslaRage's Loot Mod汉化
;============================================
; TECH TEMPLATES
;============================================

[UnlockRareBox X2TechTemplate_TLM]
DisplayName="解锁稀有战利品箱"
Summary="虽然早就有所耳闻，但亲眼见到这些箱子还是觉得很不可思议。它不像是变种人的，打开它应该很安全，里面的东西想必很有用。"

[UnlockEpicBox X2TechTemplate_TLM]
DisplayName="解锁史诗战利品箱"
Summary="它和我们找到的其他箱子很像，上面有很难辨认的铭文，这可能意味着我们能从中得到比一般箱子更好的东西。"

[UnlockLegoBox X2TechTemplate_TLM]
DisplayName="解锁传奇战利品箱"
Summary="结实、复杂的锁体结构，非常厉害的设计，里面的东西想必对某些人来说非常重要而有价值。"

[UnlockRareBoxInstant X2TechTemplate_TLM]
DisplayName="解锁稀有战利品箱（立即）"
Summary="虽然早就有所耳闻，但亲眼见到这些箱子还是觉得很不可思议。它不像是变种人的，打开它应该很安全，里面的东西想必很有用。"

[UnlockEpicBoxInstant X2TechTemplate_TLM]
DisplayName="解锁史诗战利品箱（立即）"
Summary="它和我们找到的其他箱子很像，上面有很难辨认的铭文，这可能意味着我们能从中得到比一般箱子更好的东西。"

[UnlockLegoBoxInstant X2TechTemplate_TLM]
DisplayName="解锁传奇战利品箱（立即）"
Summary="结实、复杂的锁体结构，非常厉害的设计，里面的东西想必对某些人来说非常重要而有价值。"

;============================================
; ITEM TEMPLATES
;============================================

[RareBox X2ItemTemplate_LootBox]
FriendlyName="稀有战利品箱"
FriendlyNamePlural="稀有战利品箱"
BriefSummary="虽然早就有所耳闻，但亲眼见到这些箱子还是觉得很不可思议。它不像是变种人的，打开它应该很安全，里面的东西想必很有用。"

[EpicBox X2ItemTemplate_LootBox]
FriendlyName="史诗战利品箱"
FriendlyNamePlural="史诗战利品箱"
BriefSummary="它和我们找到的其他箱子很像，上面有很难辨认的铭文，这可能意味着我们能从中得到比一般箱子更好的东西。"

[LegoBox X2ItemTemplate_LootBox]
FriendlyName="传奇战利品箱"
FriendlyNamePlural="传奇战利品箱"
BriefSummary="结实、复杂的锁体结构，非常厉害的设计，里面的东西想必对某些人来说非常重要而有价值。"

;============================================
; AMMO UPGRADES - BASIC
;============================================

[TLMUpgrade_APRounds X2WeaponUpgradeTemplate_TLMAmmo]
FriendlyName="穿甲子弹"
FriendlyNamePlural="穿甲子弹"
BriefSummary="使用超高强度超轻量的外星材料，100%纯手工打造，这些子弹可以无视敌人的护甲，带来（全额）致命伤害。"
TinySummary="+弹药伤害, -弹匣大小"

[TLMUpgrade_TracerRounds X2WeaponUpgradeTemplate_TLMAmmo]
FriendlyName="曳光子弹"
FriendlyNamePlural="曳光子弹"
BriefSummary="高科技\"智能子弹\"在开火后将及时向射手反馈详细的追踪数据。装备这种特殊弹药的射手的命中+<Ability:TRACERROUNDSAIMBONUS/>。"
TinySummary="+弹药伤害, -弹匣大小"

[TLMUpgrade_IncendiaryRounds X2WeaponUpgradeTemplate_TLMAmmo]
FriendlyName="火龙子弹"
FriendlyNamePlural="火龙子弹"
BriefSummary="火龙子弹带有高度易燃的微型弹头，可以对所有目标造成更多伤害，甚至会灼烧某些目标。"
TinySummary="+弹药伤害, -弹匣大小"

[TLMUpgrade_TalonRounds X2WeaponUpgradeTemplate_TLMAmmo]
FriendlyName="利爪子弹"
FriendlyNamePlural="利爪子弹"
BriefSummary="这些子弹击中外星人的身体时会碎成无数块，提升+<Ability:TALONROUNDSCRITCHANCE/>%暴击率和+<Ability:TALONROUNDSCRITDAMAGEBONUS/>暴击伤害。"
TinySummary="+弹药伤害, -弹匣大小"

[TLMUpgrade_VenomRounds X2WeaponUpgradeTemplate_TLMAmmo]
FriendlyName="毒液子弹"
FriendlyNamePlural="毒液子弹"
BriefSummary="这些子弹的弹头内的微型胶囊装有一种见效极快的剧毒，对人类和外星人都有效。被击中目标会受到额外伤害。"
TinySummary="+弹药伤害, -弹匣大小"

[TLMUpgrade_BluescreenRounds X2WeaponUpgradeTemplate_TLMAmmo]
FriendlyName="蓝屏子弹"
FriendlyNamePlural="蓝屏子弹"
BriefSummary="以战前一种普通又难以解释清楚的计算机现象命名，蓝屏子弹会对电子系统造成（严重）破坏。"
TinySummary="+弹药伤害, -弹匣大小"

[TLMUpgrade_MZAntiVioletRounds X2WeaponUpgradeTemplate_TLMAmmo]
FriendlyName="反灵能子弹"
FriendlyNamePlural="反灵能子弹"
BriefSummary="反灵能子弹释放混乱波，对拥有灵能的敌人触发反噬伤害，并使能量护盾失效。由Mitzruti工业制造。"
TinySummary="+弹药伤害, -弹匣大小"

[TLMUpgrade_MZEnervativeRounds X2WeaponUpgradeTemplate_TLMAmmo]
FriendlyName="削弱子弹"
FriendlyNamePlural="削弱子弹"
BriefSummary="这种子弹会释放出溅射碎片，干扰外星武器，降低敌人伤害。由Mitzruti工业制造。"
TinySummary="+弹药伤害, -弹匣大小"

[TLMUpgrade_RiotRounds X2WeaponUpgradeTemplate_TLMAmmo]
FriendlyName="镇暴子弹"
FriendlyNamePlural="镇暴子弹"
BriefSummary="这种子弹牺牲了杀伤力，使我们有机会暂时击晕敌人。由MrShadowCX工业制造。"
TinySummary="+弹药伤害, -弹匣大小"

[TLMUpgrade_FalconRounds X2WeaponUpgradeTemplate_TLMAmmo]
FriendlyName="猎鹰子弹（近炸）"
FriendlyNamePlural="猎鹰子弹（近炸）"
BriefSummary="这种子弹在接近敌人时爆炸，造成+2额外伤害。由MrShadowCX工业制造。"
TinySummary="+弹药伤害, -弹匣大小"

[TLMUpgrade_FlechetteRounds X2WeaponUpgradeTemplate_TLMAmmo]
FriendlyName="箭形霰弹"
FriendlyNamePlural="箭形霰弹"
BriefSummary="这种子弹仅能破坏内部器官，但不足以穿透躯体。由MrShadowCX工业制造。"
TinySummary="+弹药伤害, -弹匣大小"

[TLMUpgrade_NeedleRounds X2WeaponUpgradeTemplate_TLMAmmo]
FriendlyName="针刺子弹"
FriendlyNamePlural="针刺子弹"
BriefSummary="这种子弹不足以穿透掩体，但加强了肉体杀伤力。由MrShadowCX工业制造。"
TinySummary="+弹药伤害, -弹匣大小"

[TLMUpgrade_AcidRounds X2WeaponUpgradeTemplate_TLMAmmo]
FriendlyName="酸性子弹"
FriendlyNamePlural="酸性子弹"
BriefSummary="这种子弹可以酸蚀敌人，并造成额外伤害。由MrShadowCX工业制造。"
TinySummary="+弹药伤害, -弹匣大小"

[TLMUpgrade_RedscreenRounds X2WeaponUpgradeTemplate_TLMAmmo]
FriendlyName="红屏子弹"
FriendlyNamePlural="红屏子弹"
BriefSummary="这种子弹牺牲对机械单位的伤害，但大大削弱敌人的黑客防御，它是蓝屏子弹的实验型号。由MrShadowCX工业制造。"
TinySummary="+弹药伤害, -弹匣大小"

[TLMUpgrade_AshBlackIceRounds X2WeaponUpgradeTemplate_TLMAmmo]
FriendlyName="黑冰子弹"
FriendlyNamePlural="黑冰子弹"
BriefSummary="这种子弹携带了沈开发的\"黑冰协议\"武器化版本。病毒一经传播，就能关闭系统，并对机器人和依靠（计算机）技术的敌人造成严重的内部破坏。由神秘发明家Ashlynne制造。"
TinySummary="+弹药伤害, -弹匣大小"

[TLMUpgrade_AshViperRounds X2WeaponUpgradeTemplate_TLMAmmo]
FriendlyName="毒蛇子弹"
FriendlyNamePlural="毒蛇子弹"
BriefSummary="这种子弹将毒蛇毒腺中发现的混合物与我们的实验弹药相结合，是一种更有效的毒液子弹。由神秘发明家Ashlynne制造。"
TinySummary="+弹药伤害, -弹匣大小"

[TLMUpgrade_AshInfernoRounds X2WeaponUpgradeTemplate_TLMAmmo]
FriendlyName="火狱子弹"
FriendlyNamePlural="火狱子弹"
BriefSummary="这种子弹将火蛇腺体中发现的混合物与一个爆炸火帽相结合。这是一种特殊的子弹，命中时造成严重伤害，并使目标点燃。由神秘发明家Ashlynne制造。"
TinySummary="+弹药伤害, -弹匣大小"

;============================================
; AMMO UPGRADES - ADVANCED
;============================================

[TLMUpgrade_APRoundsAdv X2WeaponUpgradeTemplate_TLMAmmo]
FriendlyName="高级穿甲子弹"
FriendlyNamePlural="穿甲子弹"
BriefSummary="使用超高强度超轻量的外星材料，100%纯手工打造，这些子弹可以无视敌人的护甲，带来（全额）致命伤害。"
TinySummary="+弹药伤害, +弹匣大小"

[TLMUpgrade_TracerRoundsAdv X2WeaponUpgradeTemplate_TLMAmmo]
FriendlyName="高级曳光子弹"
FriendlyNamePlural="曳光子弹"
BriefSummary="高科技\"智能子弹\"在开火后将及时向射手反馈详细的追踪数据。装备这种特殊弹药的射手的命中+<Ability:TRACERROUNDSAIMBONUS/>。"
TinySummary="+弹药伤害, +弹匣大小"

[TLMUpgrade_IncendiaryRoundsAdv X2WeaponUpgradeTemplate_TLMAmmo]
FriendlyName="高级火龙子弹"
FriendlyNamePlural="火龙子弹"
BriefSummary="火龙子弹带有高度易燃的微型弹头，可以对所有目标造成更多伤害，甚至会灼烧某些目标。"
TinySummary="+弹药伤害, +弹匣大小"

[TLMUpgrade_TalonRoundsAdv X2WeaponUpgradeTemplate_TLMAmmo]
FriendlyName="高级利爪子弹"
FriendlyNamePlural="利爪子弹"
BriefSummary="这些子弹击中外星人的身体时会碎成无数块，提升+<Ability:TALONROUNDSCRITCHANCE/>%暴击率和+<Ability:TALONROUNDSCRITDAMAGEBONUS/>暴击伤害。"
TinTinySummary="+弹药伤害, +弹匣大小"

[TLMUpgrade_VenomRoundsAdv X2WeaponUpgradeTemplate_TLMAmmo]
FriendlyName="高级毒液子弹"
FriendlyNamePlural="毒液子弹"
BriefSummary="这些子弹的弹头内的微型胶囊装有一种见效极快的剧毒，对人类和外星人都有效。被击中目标会受到额外伤害。"
TinySummary="+弹药伤害, +弹匣大小"

[TLMUpgrade_BluescreenRoundsAdv X2WeaponUpgradeTemplate_TLMAmmo]
FriendlyName="高级蓝屏子弹"
FriendlyNamePlural="蓝屏子弹"
BriefSummary="以战前一种普通又难以解释清楚的计算机现象命名，蓝屏子弹会对电子系统造成（严重）破坏。"
TinySummary="+弹药伤害, +弹匣大小"

[TLMUpgrade_MZAntiVioletRoundsAdv X2WeaponUpgradeTemplate_TLMAmmo]
FriendlyName="高级反灵能子弹"
FriendlyNamePlural="反灵能子弹"
BriefSummary="反灵能子弹释放混乱波，对拥有灵能的敌人触发反噬伤害，并使能量护盾失效。由Mitzruti工业制造。"
TinySummary="+弹药伤害, +弹匣大小"

[TLMUpgrade_MZEnervativeRoundsAdv X2WeaponUpgradeTemplate_TLMAmmo]
FriendlyName="高级削弱子弹"
FriendlyNamePlural="削弱子弹"
BriefSummary="这种子弹会释放出溅射碎片，干扰外星武器，降低敌人伤害。由Mitzruti工业制造。"
TinySummary="+弹药伤害, +弹匣大小"

[TLMUpgrade_RiotRoundsAdv X2WeaponUpgradeTemplate_TLMAmmo]
FriendlyName="高级镇暴子弹"
FriendlyNamePlural="镇暴子弹"
BriefSummary="这种子弹牺牲了杀伤力，使我们有机会暂时击晕敌人。由MrShadowCX工业制造。"
TinySummary="+弹药伤害, +弹匣大小"

[TLMUpgrade_FalconRoundsAdv X2WeaponUpgradeTemplate_TLMAmmo]
FriendlyName="高级猎鹰子弹（近炸）"
FriendlyNamePlural="猎鹰子弹（近炸）"
BriefSummary="这种子弹在接近敌人时爆炸，造成+2额外伤害。由MrShadowCX工业制造。"
TinySummary="+弹药伤害, +弹匣大小"

[TLMUpgrade_FlechetteRoundsAdv X2WeaponUpgradeTemplate_TLMAmmo]
FriendlyName="高级箭形霰弹"
FriendlyNamePlural="箭形霰弹"
BriefSummary="这种子弹仅能破坏内部器官，但不足以穿透躯体。由MrShadowCX工业制造。"
TinySummary="+弹药伤害, +弹匣大小"

[TLMUpgrade_NeedleRoundsAdv X2WeaponUpgradeTemplate_TLMAmmo]
FriendlyName="高级针刺子弹"
FriendlyNamePlural="针刺子弹"
BriefSummary="这种子弹不足以穿透掩体，但加强了肉体杀伤力。由MrShadowCX工业制造。"
TinySummary="+弹药伤害, +弹匣大小"

[TLMUpgrade_AcidRoundsAdv X2WeaponUpgradeTemplate_TLMAmmo]
FriendlyName="高级酸性子弹"
FriendlyNamePlural="酸性子弹"
BriefSummary="这种子弹可以酸蚀敌人，并造成额外伤害。由MrShadowCX工业制造。"
TinySummary="+弹药伤害, +弹匣大小"

[TLMUpgrade_RedscreenRoundsAdv X2WeaponUpgradeTemplate_TLMAmmo]
FriendlyName="高级红屏子弹"
FriendlyNamePlural="红屏子弹"
BriefSummary="这种子弹牺牲对机械单位的伤害，但大大削弱敌人的黑客防御，它是蓝屏子弹的实验型号。由MrShadowCX工业制造。"
TinySummary="+弹药伤害, +弹匣大小"

[TLMUpgrade_AshBlackIceRoundsAdv X2WeaponUpgradeTemplate_TLMAmmo]
FriendlyName="高级黑冰子弹"
FriendlyNamePlural="黑冰子弹"
BriefSummary="这种子弹携带了沈开发的\"黑冰协议\"武器化版本。病毒一经传播，就能关闭系统，并对机器人和依靠（计算机）技术的敌人造成严重的内部破坏。由神秘发明家Ashlynne制造。"
TinySummary="+弹药伤害, +弹匣大小"

[TLMUpgrade_AshViperRoundsAdv X2WeaponUpgradeTemplate_TLMAmmo]
FriendlyName="高级毒蛇子弹"
FriendlyNamePlural="毒蛇子弹"
BriefSummary="这种子弹将毒蛇毒腺中发现的混合物与我们的实验弹药相结合，是一种更有效的毒液子弹。由神秘发明家Ashlynne制造。"
TinySummary="+弹药伤害, +弹匣大小"

[TLMUpgrade_AshInfernoRoundsAdv X2WeaponUpgradeTemplate_TLMAmmo]
FriendlyName="高级火狱子弹"
FriendlyNamePlural="火狱子弹"
BriefSummary="这种子弹将火蛇腺体中发现的混合物与一个爆炸火帽相结合。这是一种特殊的子弹，命中时造成严重伤害，并使目标点燃。由神秘发明家Ashlynne制造。"
TinySummary="+弹药伤害, +弹匣大小"

;============================================
; RARITY TEMPLATES
;============================================

[Rare X2RarityTemplate]
FriendlyName = "稀有"

[Epic X2RarityTemplate]
FriendlyName = "史诗"

[Lego X2RarityTemplate]
FriendlyName = "传奇"

;============================================
; UPGRADE DECK TEMPLATES
;============================================

; When naming these, pretend that they will be appended with the word "Upgrades"
[RefnDeck X2UpgradeDeckTemplate]
FriendlyName = "改良"

[BaseDeckT1 X2UpgradeDeckTemplate]
FriendlyName = "1级基础"

[BaseDeckT2 X2UpgradeDeckTemplate]
FriendlyName = "2级基础"

[BaseDeckT3 X2UpgradeDeckTemplate]
FriendlyName = "3级基础"

[MeleeBaseDeckT1 X2UpgradeDeckTemplate]
FriendlyName = "1级近战武器"

[MeleeBaseDeckT2 X2UpgradeDeckTemplate]
FriendlyName = "2级近战武器"

[MeleeBaseDeckT3 X2UpgradeDeckTemplate]
FriendlyName = "3级近战武器"

[ShieldBaseDeckT1 X2UpgradeDeckTemplate]
FriendlyName = "1级盾牌"

[ShieldBaseDeckT2 X2UpgradeDeckTemplate]
FriendlyName = "2级盾牌"

[ShieldBaseDeckT3 X2UpgradeDeckTemplate]
FriendlyName = "3级盾牌"

[AmmoDeck X2UpgradeDeckTemplate]
FriendlyName = "子弹"

[BaseGLDeck X2UpgradeDeckTemplate]
FriendlyName = "基础泰斯拉战利品"

[AmmoGLDeck X2UpgradeDeckTemplate]
FriendlyName = "扩展泰斯拉战利品"

[ArmorBaseDeck X2UpgradeDeckTemplate]
FriendlyName = "基础盔甲"

[ArmorUtilityDeck X2UpgradeDeckTemplate]
FriendlyName = "通用盔甲"

[ArmorRemoveME X2UpgradeDeckTemplate]
FriendlyName = "智能空槽"

[ArmorLegoDeck X2UpgradeDeckTemplate]
FriendlyName = "传奇盔甲"

[GremlinBaseDeck X2UpgradeDeckTemplate]
FriendlyName = "协议"

[PsiTier1n2 X2UpgradeDeckTemplate]
FriendlyName = "1，2级宝石（灵能）"

[PsiTier3 X2UpgradeDeckTemplate]
FriendlyName = "3级宝石（灵能）"

[LegoDeck X2UpgradeDeckTemplate]
FriendlyName = "传奇"

;============================================
; OTHERS
;============================================

[UIScreenListener_MCM]
TabLabel = "泰斯拉之怒战利品"
GeneralSettings = "常规设置"
AmmoUpgradeWarning = "启用子弹升级配件警告弹窗"
AmmoUpgradeWarningToolTip = "当[子弹升级配件]和[随身栏内子弹]发生冲突时显示弹窗"
PageTitle = "泰斯拉之怒战利品模组/TeslaRage's Loot Mod"

[UIChooseClass_TLMSalvage]
m_strTitle="选择回收项目"
m_strInventoryLabel="可回收物品："
m_strBuy="回收"
m_strAvailableUpgrades = "可回收升级配件："
m_strCloseSalvageScreen = "关闭回收屏幕"
m_strCloseRefund = "关闭此窗口将退还消耗的成本。不会回收任何物品。需要重做试验场[回收]项目。确定关闭吗？"

[X2EventListener_TLM]
strSlotLocked = "锁定·TLM"
strAmmoEquipped = "检测到物品栏实验弹药与子弹升级配件冲突"
strAmmoEquippedMessage = "由于<WEAPON_NAME>装有<AMMOUPGRADE_NAME>升级配件，因此不会保留<AMMO_NAME>的实验弹药效果。不过<AMMO_NAME>仍然会影响没有子弹升级配件的其他已装备武器。"
strAmmoUpgradeExistMessage = "由于装有的<AMMOUPGRADE_NAME>升级配件，携带的实验弹药<AMMO_NAME>将不对<WEAPON_NAME>产生效果。"

[X2DownloadableContentInfo_TeslaLootMod]

strHasAmmoAlreadyEquipped = "已装备子弹"
strWeaponHasAmmoUpgrade = "武器已有子弹升级配件"
strRounds = "子弹"
strPlus = "+"

;暗白：部分称号应该有规律，对应不同种类的装备。
[X2DownloadableContentInfo_TeslaLootMod]

+RandomWeaponNickNames[0] = "致命风暴" ;Perfect Storm
+RandomWeaponNickNames[1] = "雷霆召唤" ;Thundercall
+RandomWeaponNickNames[2] = "黑夜守望" ;Nightwatch
+RandomWeaponNickNames[3] = "复仇女神" ;Fury
+RandomWeaponNickNames[4] = "夏娃之足" ;Toots
+RandomWeaponNickNames[5] = "末日使者" ;Endbringer
+RandomWeaponNickNames[6] = "奥核之眼" ;The Oculus
+RandomWeaponNickNames[7] = "三位一体" ;Trinity
+RandomWeaponNickNames[8] = "均衡器" ;Equalizer
+RandomWeaponNickNames[9] = "雷电" ;Lightning
+RandomWeaponNickNames[10] = "永世长眠" ;Eternal Rest
+RandomWeaponNickNames[11] = "祸根" ;Undoing
+RandomWeaponNickNames[12] = "恩典" ;Grace
+RandomWeaponNickNames[13] = "荣耀召唤" ;Honor's Call
+RandomWeaponNickNames[14] = "暗影之月" ;Shadowmoon
+RandomWeaponNickNames[15] = "传手" ;Snapper担任传球的运动员
+RandomWeaponNickNames[16] = "命运" ;Destiny
+RandomWeaponNickNames[17] = "灵魂燃烧" ;Soulburn
+RandomWeaponNickNames[18] = "风火轮" ;Gov'ner玩具车品牌风火轮的一个系列
+RandomWeaponNickNames[19] = "临终祈祷" ;Last Rites
+RandomWeaponNickNames[20] = "大灾变" ;Cataclysm
+RandomWeaponNickNames[21] = "重锤" ;The Hammer
+RandomWeaponNickNames[22] = "狼疮" ;Lupus
+RandomWeaponNickNames[23] = "待命者" ;Standby
+RandomWeaponNickNames[24] = "轨迹" ;Orbit
+RandomWeaponNickNames[25] = "监视" ;Stakeout
+RandomWeaponNickNames[26] = "粉碎" ;Crush
+RandomWeaponNickNames[27] = "迅雷" ;Thunder
+RandomWeaponNickNames[28] = "公正" ;Justice
+RandomWeaponNickNames[29] = "忠诚" ;Devotion
+RandomWeaponNickNames[30] = "尽职" ;Due Diligence
+RandomWeaponNickNames[31] = "糖" ;Sugar
+RandomWeaponNickNames[32] = "闪电" ;Lightningflash
+RandomWeaponNickNames[33] = "恶人" ;Wicked
+RandomWeaponNickNames[34] = "寡妇制造者" ;Widow Maker
+RandomWeaponNickNames[35] = "女武神" ;Valkyrie
+RandomWeaponNickNames[36] = "放行" ;Discharge
+RandomWeaponNickNames[37] = "欧米伽" ;Omega
+RandomWeaponNickNames[38] = "干扰" ;Disturbance
+RandomWeaponNickNames[39] = "声名狼藉" ;Infamy
+RandomWeaponNickNames[40] = "脉冲" ;Burp原意打嗝
+RandomWeaponNickNames[41] = "意志摧毁者" ;Willbreaker
+RandomWeaponNickNames[42] = "暴雨" ;Downpour
+RandomWeaponNickNames[43] = "终结" ;Termination
+RandomWeaponNickNames[44] = "军团退役者" ;Legionaire
+RandomWeaponNickNames[45] = "永恒" ;Eternity
+RandomWeaponNickNames[46] = "最后一笑" ;Last Laugh笑到最后
+RandomWeaponNickNames[47] = "提前归隐" ;Early Retirement
+RandomWeaponNickNames[48] = "审判者" ;Judged
+RandomWeaponNickNames[49] = "龙喉" ;Dragonmaw
+RandomWeaponNickNames[50] = "密语" ;Whispers
+RandomWeaponNickNames[51] = "深色印记" ;Birthmark
+RandomWeaponNickNames[52] = "暂令停赛" ;Suspension
+RandomWeaponNickNames[53] = "致哀" ;Tribute
+RandomWeaponNickNames[54] = "注射器" ;Injection
+RandomWeaponNickNames[55] = "大老爹" ;Big Daddy
+RandomWeaponNickNames[56] = "泰斯拉" ;Tesla模组作者或积极参与者名
+RandomWeaponNickNames[57] = "卡利斯塔" ;MrCloista模组作者或积极参与者名
+RandomWeaponNickNames[58] = "鲁斯狄" ;Rusty模组作者或积极参与者名
+RandomWeaponNickNames[59] = "戴普特" ;Deadput模组作者或积极参与者名
+RandomWeaponNickNames[60] = "特帕" ;TePa模组作者或积极参与者名
+RandomWeaponNickNames[61] = "维赫门蒂亚" ;Veehementia模组作者或积极参与者名
+RandomWeaponNickNames[62] = "海莉" ;h4ilst0rm模组作者或积极参与者名
+RandomWeaponNickNames[63] = "阿比兹领主" ;LordAbizi模组作者或积极参与者名
+RandomWeaponNickNames[64] = "弗拉什斯特赖克" ;Flashstriker模组作者或积极参与者名
+RandomWeaponNickNames[65] = "索菲娅" ;SOPHIA模组作者或积极参与者名
+RandomWeaponNickNames[66] = "神力女孩" ;Power Girl漫威女英雄
+RandomWeaponNickNames[67]= "千码凝视" ;1000 Yard Stare指狙击手
+RandomWeaponNickNames[68]= "恶言" ;Harsh Language
+RandomWeaponNickNames[69]= "遗言" ;The Last Word
+RandomWeaponNickNames[70]= "春分之日" ;Vernal Equinox
+RandomWeaponNickNames[71]= "以迪亚波利之名" ;In Nomine Diaboli重金属乐队专辑
+RandomWeaponNickNames[72]= "对称" ;Symmetry重金属乐队名
+RandomWeaponNickNames[73]= "迷之密码机" ;Enigma Machine重金属乐队名
+RandomWeaponNickNames[74]= "涅槃召唤" ;Nirvana Calling疑似指涅槃乐队
+RandomWeaponNickNames[75]= "小妹妹" ;Little Sister
+RandomWeaponNickNames[76]= "染血卡宾" ;Bloodsoaked Carbine染血的卡宾枪图片
+RandomWeaponNickNames[77]= "失忆症" ;Amnesia
+RandomWeaponNickNames[78]= "超级射手" ;Super Shooter
+RandomWeaponNickNames[79]= "甜心宝贝" ;Sweetie
+RandomWeaponNickNames[80]= "强子执行者" ;Hadron Enforcer漫威英雄武器
+RandomWeaponNickNames[81]= "多莉复仇" ;Dolly's Revenge电影名
+RandomWeaponNickNames[82]= "暴虐狙击手" ;Tyrannical Sniper
+RandomWeaponNickNames[83]= "狼王" ;Lord of Wolves《命运2》武器
+RandomWeaponNickNames[84]= "幻影手枪" ;Phantom Pistol
+RandomWeaponNickNames[85]= "仪式之枪" ;Ritual Gun《命运2》武器
+RandomWeaponNickNames[86]= "梦想女猎手" ;Dreamhuntress
+RandomWeaponNickNames[87]= "吊索枪" ;Slinging Musket欧洲古代武器
+RandomWeaponNickNames[88]= "新空缺" ;New Vacancy
+RandomWeaponNickNames[89]= "西风射击" ;Zephyr Shot
+RandomWeaponNickNames[90]= "音调监督" ;Tone Patrol《命运2》枪械
+RandomWeaponNickNames[91]= "战后新生潮" ;Baby Boomer婴儿潮
+RandomWeaponNickNames[92]= "没空解释" ;No Time To Explain
+RandomWeaponNickNames[93]= "千码注视" ;1000 Yard Stare
+RandomWeaponNickNames[94]= "恶语" ;Harsh Language
+RandomWeaponNickNames[95]= "自动9型" ;The Auto 9《机械战警》墨菲专用武器
+RandomWeaponNickNames[96]= "铁木之枪" ;Ironbark Rifle《命运2》武器
+RandomWeaponNickNames[97]= "赴险者" ;Riskrunner《命运2》武器
+RandomWeaponNickNames[98]= "流放救赎" ;Banished Redemption疑似《命运2》武器
+RandomWeaponNickNames[99]= "闪光旋转" ;Glinting Revolver闪光左轮枪
+RandomWeaponNickNames[100]= "失调和音" ;Dissonance疑似《命运2》武器
+RandomWeaponNickNames[101]= "未来之瑕" ;Furture Imperfect《命运2》刀剑武器
+RandomWeaponNickNames[102]= "明日诺言" ;Tomorrow's Promise《命运2》火箭发射器
+RandomWeaponNickNames[103]= "灭绝" ;Extinction
+RandomWeaponNickNames[104]= "重锤" ;The Hammer
+RandomWeaponNickNames[105]= "遗产" ;Legacy
+RandomWeaponNickNames[106]= "末世使者" ;Endbringer
+RandomWeaponNickNames[107]= "征服者" ;Vanquisher疑似呼应《美女武士》中刀剑武器
+RandomWeaponNickNames[108]= "涌血" ;Bloodsurge
+RandomWeaponNickNames[109]= "骤雨" ;Downpour
+RandomWeaponNickNames[110]= "地震" ;Earthquake
+RandomWeaponNickNames[111]= "暗影钢" ;Shadowsteel
+RandomWeaponNickNames[112]= "恐怖收割" ;Grim Harvest
+RandomWeaponNickNames[113]= "饮血" ;Bloodquench
+RandomWeaponNickNames[114]= "决战时刻" ;Crunch
+RandomWeaponNickNames[115]= "盯梢" ;Stakeout
+RandomWeaponNickNames[116]= "冷落" ;Snubbery
+RandomWeaponNickNames[117]= "大灾难" ;Catastrophe
+RandomWeaponNickNames[118]= "超新星" ;Supernova
+RandomWeaponNickNames[119]= "强痛" ;Agony
+RandomWeaponNickNames[120]= "毁灭" ;Deavastation
+RandomWeaponNickNames[121]= "破伤风" ;Lockjaw
+RandomWeaponNickNames[122]= "蛇之咬" ;Snake Bite
+RandomWeaponNickNames[123]= "狂热" ;Zealotry
+RandomWeaponNickNames[124]= "神性" ;Divinity
+RandomWeaponNickNames[125]= "神学" ;Theodicy
+RandomWeaponNickNames[126]= "净化器" ;Purifier
+RandomWeaponNickNames[127]= "脑死者" ;Braindead
+RandomWeaponNickNames[128]= "破誓者" ;Oathbreaker
+RandomWeaponNickNames[129]= "虚空" ;The Void
+RandomWeaponNickNames[130]= "始终" ;Alpha and Omega
+RandomWeaponNickNames[131]= "暴虐冲击波" ;Tyrannical Blaster
+RandomWeaponNickNames[132]= "报仇者" ;Vengeance
+RandomWeaponNickNames[133]= "惩罚者" ;Punisher
+RandomWeaponNickNames[134]= "湮灭" ;Deavastation
+RandomWeaponNickNames[135]= "碾压" ;Crush
+RandomWeaponNickNames[136]= "祸源" ;Undoing
+RandomWeaponNickNames[137]= "动荡" ;Earthquake
+RandomWeaponNickNames[138]= "烈焰卫士" ;Blazeguard
+RandomWeaponNickNames[139]= "哀悼者格里夫斯" ;Griever's Gleaves
+RandomWeaponNickNames[140]= "命运力场" ;Fate's Force Field
+RandomWeaponNickNames[141]= "生活腿甲" ;Cuisses of Life
+RandomWeaponNickNames[142]= "阿瑞尔冰甲" ;Auril's Icy Armet
+RandomWeaponNickNames[143]= "三重胸甲" ;Thrice-Sealed Plackart
+RandomWeaponNickNames[144]= "阿里阿德涅王冠" ;Ariadne's Diadem
+RandomWeaponNickNames[145]= "私人堡垒" ;Private Fortress
+RandomWeaponNickNames[146]= "伊西斯面纱" ;Veil of Isis
+RandomWeaponNickNames[147]= "分心圆匕" ;Rondels of Distraction
+RandomWeaponNickNames[148]= "诱人外衣" ;Ravishing Raiments
+RandomWeaponNickNames[149]= "野蛮开面盔" ;Barbute of Barbarism
+RandomWeaponNickNames[150]= "堕落圣骑士" ;Corrupted Paladin
+RandomWeaponNickNames[151]= "送葬者" ;Undertaker
+RandomWeaponNickNames[152]= "诡诈王冠" ;Cunning of the Crown
+RandomWeaponNickNames[153]= "古武终结者" ;Ender of Ancient Power
+RandomWeaponNickNames[154]= "幽灵代币" ;Token of Wraiths
+RandomWeaponNickNames[155]= "仪式战刃" ;Ritual Warglaive
+RandomWeaponNickNames[156]= "悔恨" ;Remorse
+RandomWeaponNickNames[157]= "分离" ;Separation
+RandomWeaponNickNames[158]= "锋利战刃" ;Sharpened Warblade
+RandomWeaponNickNames[159]= "鬼铸穿刺者" ;Ghost-Forged Impaler与《魔兽世界》有关
+RandomWeaponNickNames[160]= "颤栗脊柱" ;Shiverspine与《炉石传说》有关
+RandomWeaponNickNames[161]= "哀伤之约" ;Pact of Woe
+RandomWeaponNickNames[162]= "修炼之斩" ;Honed Slash
+RandomWeaponNickNames[163]= "狂暴枫镰" ;Stormfury Maple Sickle
+RandomWeaponNickNames[164]= "恩宠" ;Grace
+RandomWeaponNickNames[165]= "幽暗" ;Darkness
+RandomWeaponNickNames[166]= "悔恨领域" ;Reach of Regret
+RandomWeaponNickNames[167]= "猎血手术刀" ;Blood Reaper Scalpel
+RandomWeaponNickNames[168]= "虚空梦魇" ;Netherbane
+RandomWeaponNickNames[169]= "断绝" ;Severence
+RandomWeaponNickNames[170]= "冰封恶魔收割者" ;Frozen Demonic Reaper
+RandomWeaponNickNames[171]= "夜魇" ;Nightbane
+RandomWeaponNickNames[172]= "鬼造穿刺者" ;Ghost-Forged Impaler
+RandomWeaponNickNames[173]= "隐形利刃" ;Edge of Stealth
+RandomWeaponNickNames[174]= "至黑之心" ;Blackest Heart
+RandomWeaponNickNames[175]= "炽热战刃" ;Fiery Warglaive
+RandomWeaponNickNames[176]= "古玛瑙砍杀者" ;Antique Onyx Slasher
+RandomWeaponNickNames[177]= "化身脊柱" ;Incarnated Spine
+RandomWeaponNickNames[178]= "新月之刃" ;Crescent Moon Blade
+RandomWeaponNickNames[179]= "嗜血手术刀" ;Blood Reaper Scalpel
+RandomWeaponNickNames[180]= "灵魂毁灭者" ;Soulbreaker
+RandomWeaponNickNames[181]= "仪仗战刃" ;Ritual Warglaive
+RandomWeaponNickNames[182]= "铸铁战刃" ;Impure Iron Warglaive
+RandomWeaponNickNames[183]= "附魔幻影钢" ;Enchanted Phantomsteel
+RandomWeaponNickNames[184]= "死神手术刀" ;Death's Own Scalpel
+RandomWeaponNickNames[185]= "变节" ;Treachery
+RandomWeaponNickNames[186]= "夹击" ;Pincer Move
+RandomWeaponNickNames[187]= "符文熔铸掠夺者" ;Rune-Forged Reaver
+RandomWeaponNickNames[188]= "巨魔收割者" ;Trollreaper
+RandomWeaponNickNames[189]= "长船守护者" ;Guardian Longships
+RandomWeaponNickNames[190]= "荣耀锻造" ;Glory of the Forge
+RandomWeaponNickNames[191]= "天陨之刃" ;Skyfall Chopper
+RandomWeaponNickNames[192]= "命名者" ;Nametaker
+RandomWeaponNickNames[193]= "父辈之冠" ;Champion of TheFather
+RandomWeaponNickNames[194]= "致命雷彻" ;Deadly Reacher
+RandomWeaponNickNames[195]= "守誓者之钢" ;Oathkeeper's Steel
+RandomWeaponNickNames[196]= "荣耀新月" ;Honor's Crescent
+RandomWeaponNickNames[197]= "火风暴利刃" ;Firestorm Edge
+RandomWeaponNickNames[198]= "暴风哭泣" ;Whimper and Beg

[X2Effect_TLMAbilityListener]
strSprintReload = "冲刺装弹"
strChargesLeft = "剩余充能"

[X2Ability_TLM]
strAimBonusPerVisibleEnemy = "反应枪托"
strFriendlyNameSingleOut = "聚焦瞄准"

[UIChooseClass_TLM]
m_strTitle = "选择分类"
m_strInventoryLabel = "可用选项："
m_strBuy = "确认"
m_strTopObtained = "\n\n以前获得的物品\n"
m_strEquippedOn = "装配到"
m_strAvailable = "\n[可用]"
m_strSoldierAbleToEquip = "\n可装配以下士兵：\n"
m_strUpgrades = "升级"
m_strUpgrade = "升级"
m_strPrctChance = "%几率"

CatLabels[eCat_Rifle]="突击步枪"
CatLabels[eCat_Cannon]="加农炮"
CatLabels[eCat_Shotgun]="霰弹枪"
CatLabels[eCat_SniperRifle]="狙击步枪"
CatLabels[eCat_GrenadeLauncher]="榴弹发射器"
CatLabels[eCat_Gremlin]="小精灵"
CatLabels[eCat_Pistol]="手枪"
CatLabels[eCat_PsiAmp]="灵能增幅器"
CatLabels[eCat_Sword]="剑"
CatLabels[eCat_VektorRifle]="维克托步枪"
CatLabels[eCat_Bullpup]="无托式"
CatLabels[eCat_Gauntlet]="拳刃"
CatLabels[eCat_Sidearm]="自动手枪"
CatLabels[eCat_Wristblade]="开颅刃"
CatLabels[eCat_SparkRifle]="Spark步枪"
CatLabels[eCat_Smg]="冲锋枪"
CatLabels[eCat_Glaive]="长柄刀"
CatLabels[eCat_Chemthrower]="化学喷射器"
CatLabels[eCat_CombatKnife]="战斗匕首"
CatLabels[eCat_Shield]="防弹盾牌"
CatLabels[eCat_SparkShield]="Spark盾牌"
CatLabels[eCat_Canister]="燃料罐"
CatLabels[eCat_Arcthrower]="电弧发射器"
CatLabels[eCat_SawedOffShotgun]="短管霰弹枪"
CatLabels[eCat_HoloTargeter]="全息瞄准仪"
CatLabels[eCat_Armor]="盔甲"
CatLabels[eCat_Medikit]="急救包"
CatLabels[eCat_Rando]="随机"

CatDescriptions[eCat_Rifle] = "多型号的标准步兵轻武器，类似20年前使用的步枪。"
CatDescriptions[eCat_Cannon] = "结构简易的小队轻型支援武器，专门用于加强火力。"
CatDescriptions[eCat_Shotgun] = "标准步兵轻武器，专为近距离作战设计的武器。"
CatDescriptions[eCat_SniperRifle] = "狙击步枪，专为中、远距离作战设计的武器。"
CatDescriptions[eCat_GrenadeLauncher] = "允许士兵将榴弹发射得更远，并扩大爆炸攻击范围。"
CatDescriptions[eCat_Gremlin] = "小精灵能让士兵在更安全距离外执行各种战场任务。"
CatDescriptions[eCat_Pistol] = "这完全是一把副武器，尽管有些模组可把它用作主武器。"
CatDescriptions[eCat_PsiAmp] = "允许（灵能）士兵发动灵能能力。"
CatDescriptions[eCat_Sword] = "一种带刃兵器，能让士兵在近战中杀死敌人。"
CatDescriptions[eCat_VektorRifle] = "精准步枪，专为长途交战和小队支援设计的武器。"
CatDescriptions[eCat_Bullpup] = "改良自变种人的武器，近距离内的阻滞力非常惊人。"
CatDescriptions[eCat_Gauntlet] = "独特的护手设计，提升使用者灵能，不被天赋所限制。"
CatDescriptions[eCat_Sidearm] = "相对于传统手枪配置，经过模改，提升射速和操控性。"
CatDescriptions[eCat_Wristblade] = "开颅刃既是致命的穿刺武器，也是增强移动的工具。"
CatDescriptions[eCat_SparkRifle] = "强大但沉重的加农炮，专门为SPARK单位设计。"
CatDescriptions[eCat_Smg] = "冲锋枪是标准突击步枪的轻型替代品，缺乏同样冲击力，远距离精度较低。"
CatDescriptions[eCat_Glaive] = "沉重的近战装备，牺牲士兵敏捷为代价，换取致命的近战攻击能力。"
CatDescriptions[eCat_Chemthrower] = "宽范围、多目标武器，能够造成一系列化学战争罪行。"
CatDescriptions[eCat_CombatKnife] = "近战武器，用于个人近身防卫和战斗。"
CatDescriptions[eCat_Shield] = "盾牌是已知的人类最古老的防护手段之一。"
CatDescriptions[eCat_SparkShield] = "SPARK身型尺寸的战术防弹盾。"
CatDescriptions[eCat_Canister] = "装有大量液体化学试剂的燃料罐。"
CatDescriptions[eCat_Arcthrower] = "允许在远处击晕敌人。"
CatDescriptions[eCat_SawedOffShotgun] = "强大的短距离副武器。"
CatDescriptions[eCat_HoloTargeter] = "标记敌方目标，为小队其他成员提供命中加成。"
CatDescriptions[eCat_Armor] = "提供一些保护，以对抗变种人和外星人的武器。"
CatDescriptions[eCat_Medikit] = "一种可在战场上治疗轻伤的实用物品。"
CatDescriptions[eCat_Rando] = "\n\n\n\n\n\n我运气好，不想自己选择。给我一个完全随机的物品。"

CatImages[eCat_Rifle]="UILibrary_InvCatImages.Inv_Rifle_TLM"						;"Assault Rifle"
CatImages[eCat_Cannon]="UILibrary_InvCatImages.Inv_Cannon_TLM"						;"Cannon"
CatImages[eCat_Shotgun]="UILibrary_InvCatImages.Inv_Shotgun_TLM"					;"Shotgun"
CatImages[eCat_SniperRifle]="UILibrary_InvCatImages.Inv_Sniper_TLM"					;"Sniper Rifle"
CatImages[eCat_GrenadeLauncher]="UILibrary_InvCatImages.Inv_GrenadeLauncher_TLM"	;"Grenade Launcher"
CatImages[eCat_Gremlin]="UILibrary_InvCatImages.Inv_Gremlin_TLM"					;"Gremlin"
CatImages[eCat_Pistol]="UILibrary_InvCatImages.Inv_Pistol_TLM"						;"Pistol"
CatImages[eCat_PsiAmp]="UILibrary_InvCatImages.Inv_PsiAmp_TLM"						;"Psiamp"
CatImages[eCat_Sword]="UILibrary_InvCatImages.Inv_Sword_TLM"						;"Sword"
CatImages[eCat_VektorRifle]="UILibrary_InvCatImages.Inv_Vektor_TLM"					;"Vektor Rifle"
CatImages[eCat_Bullpup]="UILibrary_InvCatImages.Inv_Bullpup_TLM"					;"Bullpup"
CatImages[eCat_Gauntlet]="UILibrary_InvCatImages.Inv_ShardGauntlet_TLM"				;"Gauntlet"
CatImages[eCat_Sidearm]="UILibrary_InvCatImages.Inv_Sidearm_TLM"					;"Sidearm"
CatImages[eCat_Wristblade]="UILibrary_InvCatImages.Inv_Ripjack_TLM"					;"Wristblade"
CatImages[eCat_SparkRifle]="UILibrary_InvCatImages.Inv_SparkRifle_TLM"				;"Spark Rifle"
CatImages[eCat_Smg]="UILibrary_InvCatImages.Inv_SMG_TLM"							;"SMG"
CatImages[eCat_Glaive]="UILibrary_InvCatImages.Inv_Glaive_TLM"						;"Glaive"
CatImages[eCat_Chemthrower]="UILibrary_InvCatImages.Inv_Chemthrower_TLM"			;"Chemthrower"
CatImages[eCat_CombatKnife]="UILibrary_InvCatImages.Inv_CombatKnife_TLM"			;"Combat Knife"
CatImages[eCat_Shield]="UILibrary_InvCatImages.Inv_Shield_TLM"						;"Shield"
CatImages[eCat_SparkShield]="UILibrary_InvCatImages.Inv_SparkShield_TLM"			;"Spark Shield"
CatImages[eCat_Canister]="UILibrary_InvCatImages.oInv_Canister_TLM"					;"Canister"
CatImages[eCat_Arcthrower]="UILibrary_InvCatImages.Inv_Arcthrower_TLM"				;"ArcThrower"
CatImages[eCat_SawedOffShotgun]="UILibrary_InvCatImages.Inv_SawedOff_TLM"			;"Sawed-Off Shotgun"
CatImages[eCat_HoloTargeter]="UILibrary_InvCatImages.Inv_HoloTargeter_TLM"			;"Holotargeter"
CatImages[eCat_Armor]="UILibrary_InvCatImages.Inv_Armor_TLM"						;"Armor"
CatImages[eCat_Medikit]="uilibrary_strategyimages.GTS.GTS_StayWithMe"				;"Medikit"
CatImages[eCat_Rando]="UILibrary_InvCatImages.zInv_Random_TLM"						;"Random"

